/*******************************************************************************
* Copyright (C) 2018 Maxim Integrated Products, Inc. (now owned by Analog Devices, Inc.),
* 2024 Analog Devices, Inc. This software is proprietary and
* confidential to Analog Devices, Inc. and its licensors. , All rights Reserved.
*
* This software is protected by copyright laws of the United States and
* of foreign countries. This material may also be protected by patent laws
* and technology transfer regulations of the United States and of foreign
* countries. This software is furnished under a license agreement and/or a
* nondisclosure agreement and may only be used or reproduced in accordance
* with the terms of those agreements. Dissemination of this information to
* any party or parties not specified in the license agreement and/or
* nondisclosure agreement is expressly prohibited.
*
* The above copyright notice and this permission notice shall be included
* in all copies or substantial portions of the Software.
*
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
* OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
* OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
* ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
* OTHER DEALINGS IN THE SOFTWARE.
*
* Except as contained in this notice, the name of Maxim Integrated
* Products, Inc. shall not be used except as stated in the Maxim Integrated
* Products, Inc. Branding Policy.
*
* The mere transfer of this software does not imply any licenses
* of trade secrets, proprietary technology, copyrights, patents,
* trademarks, maskwork rights, or any other form of intellectual
* property whatsoever. Maxim Integrated Products, Inc. retains all
* ownership rights.
******************************************************************************/


/**
 * @internal
 * @file MXQ_APDU.c
 * @date Apr 2014
 * @authors Stéphane Di Vito, Maxim Integrated Products Inc.
 * @authors Benjamin Vinot, Maxim Integrated Products Inc.
 *
 * @brief Handles APDU communications with the MAXQ106x.
 * @details Refer to the architecture diagram for more information.
 * @ingroup APDU
 */


#include "MXQ_Internal.h"
#include "crypto/ecc/uECC.h"
#include "crypto/hmac/sha2.h"
#include "crypto/hmac/hmac_sha2.h"
#include "crypto/hmac/hkdf.h"
#include "crypto/aes_gcm/includes.h"
#include "crypto/aes_gcm/common.h"
#include "crypto/aes_gcm/aes.h"
#include "crypto/aes_gcm/aes_wrap.h"

#define S_SC_OTP_IKM_LEN        (32)
#define S_SC_OTP_WR_CNT_LEN     (4)
#define S_SC_OTP_SALT_LEN       (S_SC_OTP_WR_CNT_LEN + S_SC_HKDF_RANDOM_LEN)
#define S_SC_OTP_MAC_SIZE       (8)
#define S_SC_OTP_MAC_KEY_SIZE   (32)
#define AES_GCM_KEYLEN_SC       (32)
#define S_SC_TAG_LEN            16
#define S_SC_DATA_LEN		    80
#define S_SC_IV_LEN             12
#define S_SECURE_CHANNEL        "SECURECHANNEL"
#define MXQ_MAXQ1061_USN_LENGTH          (24)

#ifdef USS_ST
extern int Receive_Process_Cmd(_Bool);
#endif

#ifdef NO_SECURE_CHANNEL
#warning API: Secure channel disabled
#else
typedef union
{
	struct _PACKED
	{
		mxq_u1 IV_dec[AES_IV_LEN]; //16
		mxq_u1 IV_enc[AES_IV_LEN]; //16
		mxq_u1 IV_mac[AES_IV_LEN]; //16
		mxq_u1 Key_enc[AES_KEYLEN_SC]; //16
		mxq_u1 Key_mac[AES_KEYLEN_SC]; //16
	} cbc;
    struct _PACKED
	{
		mxq_u1 IV_dec[AES_IV_LEN]; //16
		mxq_u1 IV_enc[AES_IV_LEN]; //16
		mxq_u1 Key_enc[AES_GCM_KEYLEN_SC]; //32
		mxq_u1 Key_dec[AES_GCM_KEYLEN_SC]; //32
	} gcm;
    struct _PACKED
    {
        mxq_u1 rand[S_SC_HKDF_RANDOM_LEN]; //32
        mxq_u1 ikm[S_SC_OTP_IKM_LEN]; //32
        mxq_u4 counter; //4
        mxq_u1 prevHmac[S_SC_OTP_MAC_SIZE]; //8

    } otp;

	mxq_u1 raw[SC_secretsize];

} ctx_securechannel_u;


struct
{
	ctx_securechannel_u ctx;
	unsigned char state;
	unsigned char gSecChannelMode;

} ctx_securechannel;

#endif

static mxq_u1		g_cmd_buffer[MAX_BUFFER_SIZE];
static mxq_u1*		g_cmd_data = (g_cmd_buffer + 2 * CMD_HEADER_SIZE);
static mxq_length	g_offset = 0;
#ifndef NO_SECURE_CHANNEL
static mxq_u1		g_cmd_sc_buffer[MAX_BUFFER_SIZE];
mxq_u1 gSecChannelStatus;
mxq_u1 gScEcdheKeyPair[KEYCOMPLEN256*3];
mxq_u1 gScMaxqPubKey[KEYCOMPLEN256*3];
mxq_u1 gScChallenge[16*5+16+16];
#endif

mxq_u2 cmd_2_proc_endian(mxq_u2 i)
{
	/* Since the proc is LSB */
	return (mxq_u2)((i >> 8) | (i << 8));
}

mxq_u2 proc_endian_2_cmd(mxq_u2 i)
{
	/* Since the proc is LSB */
	return (mxq_u2)((i >> 8) | (i << 8));
}


void put_u2_lsb(mxq_u2 u2val, mxq_u1* pdest, mxq_length* offset)
{
	pdest[*offset]   = (mxq_u1)u2val;
